{"nivelCero":{"claveComponente":"1430__Parar","nombreComponente":"Condiciones de Paro para el Algoritmo Genético","tipo":"Orientado al servicio","clasACM":"Theory of computation","autores":[{"nombreAutor":"","correoAutor":"","aliasGitlab":""}],"descProblema":"Este programa revisa si se han alcanzado las condiciones para que se pare la\nejecución de un algoritmo genético. El usuario puede estableces cuales de las\nsiguientes condiciones de paro desea utilizar y cuando alguna de estas se cumpla\nentonces se le indica al algoritmo genético que pare. La indicación se hace a\ntravés de la creación un archivo con nombre STOP.txt en la carpeta de trabajo\n-WORK; además se crea el archivo STATE.txt donde se reporta el estado de condiciones\nde parada. El algoritmo genético puede parar cuando:\n\n\n* Se alcanza el máximo de generaciones especificado en -MAXGEN. El número de generación\n  actual debe parecer en la carpeta actual entre paréntesis, por ejemplo: ACTGEN(8), eso\n  indica que si -MAXGEN es mayor a 8 entonces debe parar el algoritmo.\n* Se alcanza un tiempo determinado ( formato AA/MM/DD/HH/MM ) especificado en -DATE\n* Se estabiliza la población por la configuración de sus genes, se revisa para cada \n  gen si un determinado porciento -POP100 de sus valores son iguales, con lo cual se\n  considera estabilizado. Si un determinado porciento -GEN100 de genes están \n  estabilizados entonces se considera a la población como estabilizada.\n* Se estabiliza la población por los resultados obtenidos. Se dá cuando la diferencia\n  entre el peor y mejor individuo es menor a -FADIFF.\n* Cuando un individuo supera un determinado valor de aptitud, especificado en\n  -FAMAX\n* Cuando un individuo es inferior a un determinado valor de aptitud, especificado en\n  -FAMIN\n\n\nNOTA: Es posible para la ejecución del algoritmo genético si se copia un archivo con \nnombre STOP.txt a la carpeta de trabajo -FWORK.","reqFuncionales":["N/A"],"reqNoFuncionales":["N/A"],"aportacion":"N/A","similitud":"N/A","sintaxis":[{"param":"MAXGEN","tipoparam":"int","descripcion":"MAXGEN"}]},"nivelUno":null,"nivelDos":null,"nivelTres":null,"nivelCuatro":null,"nivelCinco":null,"nivelSeis":null,"nivelSiete":null,"nivelOcho":null}